Repository: wolvesart/reviews-for-google-my-business
Catalog: languages/reviews-for-google-*-business-*.po
Languages: fr_fr

source: Categories
fr_fr: Catégories

source: Loading...
fr_fr: Chargement...

source: Error fetching locations:
fr_fr: Erreur lors de la récupération des établissements :

source: Unknown error
fr_fr: Erreur inconnue

source: Network error:
fr_fr: Erreur réseau :

source: Resetting...
fr_fr: Réinitialisation...

source: Reset successful!
fr_fr: Réinitialisation réussie !

source: Error resetting reviews
fr_fr: Erreur lors de la réinitialisation des avis

source: Connection successful!
fr_fr: Connexion réussie !

source: reviews fetched.
fr_fr: avis récupérés.

source: Error:
fr_fr: Erreur :

source: Are you sure you want to reset customization to default values?
fr_fr: Êtes-vous sûr de vouloir réinitialiser la personnalisation aux valeurs par défaut ?

source: Error resetting customization:
fr_fr: Erreur lors de la réinitialisation de la personnalisation :

source: Copied!
fr_fr: Copié !

source: Please enter a category name
fr_fr: Veuillez entrer un nom de catégorie

source: Creating...
fr_fr: Création en cours…

source: Create category
fr_fr: Créer une catégorie

source: Are you sure you want to delete this category? It will be removed from all reviews that use it.
fr_fr: Êtes-vous sûr de vouloir supprimer cette catégorie ? Elle sera retirée de tous les avis qui l’utilisent.

source: Deleting...
fr_fr: Suppression…

source: Delete
fr_fr: Supprimer

source: Syncing...
fr_fr: Synchronisation…

source: ✓ Synchronization complete
fr_fr: ✓ Synchronisation terminée

source: Error syncing reviews
fr_fr: Erreur lors de la synchronisation des avis

source: Updated
fr_fr: Mis à jour

source: You do not have sufficient permissions to access this page.
fr_fr: Vous n'avez pas les permissions suffisantes pour accéder à cette page.

source: API not authenticated. Please configure OAuth from the Configuration page.
fr_fr: API non authentifiée. Veuillez configurer OAuth depuis la page de configuration.

source: Insufficient permissions
fr_fr: Autorisations insuffisantes

source: Security check failed
fr_fr: Le contrôle de sécurité a échoué

source: %d reviews deleted
fr_fr: %d avis supprimés

source: You do not have sufficient permissions.
fr_fr: Vous n'avez pas les permissions suffisantes pour accéder à cette page.

source: HTTPS is required to save API credentials. Please enable SSL/TLS on your site.
fr_fr: HTTPS est nécessaire pour sauvegarder les identifiants de l’API. Veuillez activer SSL/TLS sur votre site.

source: Security Error
fr_fr: Erreur de sécurité

source: Customization saved successfully
fr_fr: Personnalisation sauvegardée avec succès

source: Please wait %d seconds before syncing again
fr_fr: Veuillez attendre %d secondes avant de resynchroniser

source: %d reviews successfully synchronized
fr_fr: %d avis synchronisés avec succès

source: Category name is required
fr_fr: Le nom de la catégorie est requis

source: Category name cannot be empty
fr_fr: Le nom de catégorie ne peut pas être vide

source: Category "%s" created successfully
fr_fr: Catégorie « %s » créée avec succès

source: Category ID is required
fr_fr: Un identifiant de catégorie est requis

source: Invalid category ID
fr_fr: ID de catégorie invalide

source: Category not found
fr_fr: Catégorie introuvable

source: Category deleted successfully
fr_fr: Catégorie supprimée avec succès

source: Post ID is required
fr_fr: L’ID de la publication est nécessaire

source: Invalid post ID
fr_fr: Identifiant de l'article non valable

source: Review updated successfully
fr_fr: Avis mis à jour avec succès

source: Google My Business API is not authenticated. Please configure OAuth from the GMB Reviews page in the admin.
fr_fr: API non authentifiée. Veuillez configurer OAuth depuis la page de configuration.

source: Unauthorized access. You must be logged in as an administrator to complete OAuth authentication.
fr_fr: Accès non autorisé. Vous devez être connecté en tant qu’administrateur pour compléter l’authentification OAuth.

source: Security validation failed. The OAuth state parameter is invalid. This may indicate a CSRF attack or an expired authorization attempt.
fr_fr: La validation de sécurité a échoué. Le paramètre d’état OAuth est invalide. Cela peut indiquer une attaque CSRF ou une tentative d’autorisation expirée.

source: OAuth Security Error
fr_fr: Erreur de sécurité OAuth

source: No reviews to synchronize
fr_fr: Aucun avis à synchroniser

source: No valid review IDs found
fr_fr: Aucun identifiant d’avis valide trouvé

source: Anonymous
fr_fr: Anonyme

source: Review by %s
fr_fr: Avis de %s

source: [%1$s] GMB Reviews Error: %2$s
fr_fr: [%1$s] Erreur des avis GMB : %2$s

source: An error occurred in the Google My Business Reviews plugin. Context: %1$s Message: %2$s Additional data: %3$s Please check the plugin settings.
fr_fr: Une erreur est apparue dans le plugin Google My Business Reviews. Contexte : %1$s Message : %2$s Données supplémentaires : %3$s Veuillez vérifier les paramètres du plugin.

source: Google Review
fr_fr: Avis Google

source: Add New
fr_fr: Ajouter

source: Add New Review
fr_fr: Ajouter un avis

source: New Review
fr_fr: Nouvel avis

source: Edit Review
fr_fr: Modifier un avis

source: View Review
fr_fr: Voir l'avis

source: All Reviews
fr_fr: Tous les avis

source: Search Reviews
fr_fr: Rechercher des avis

source: No reviews found
fr_fr: Aucun avis trouvé

source: No reviews found in Trash
fr_fr: Aucun avis trouvé dans la corbeille

source: Review Categories
fr_fr: Catégories des avis

source: Review Category
fr_fr: Catégorie d'avis

source: Search Categories
fr_fr: Rechercher des catégories

source: Popular Categories
fr_fr: Catégories populaires

source: All Categories
fr_fr: Toutes les catégories

source: Edit Category
fr_fr: Modifier la catégorie

source: Update Category
fr_fr: Mettre à jour la catégorie

source: Add New Category
fr_fr: Ajouter une nouvelle catégorie

source: New Category Name
fr_fr: Nom de la nouvelle catégorie

source: Separate categories with commas
fr_fr: Séparez les catégories par des virgules

source: Add or remove categories
fr_fr: Ajouter ou supprimer des catégories

source: Choose from most used categories
fr_fr: Choisissez parmi les catégories les plus utilisées

source: No categories found
fr_fr: Aucune catégorie trouvée

source: Review ID is missing
fr_fr: L’identifiant de l’avis manque

source: Google My Business API is not authenticated.
fr_fr: L’API Google My Business n’est pas authentifiée.

source: Please configure OAuth from the
fr_fr: Veuillez configurer OAuth à partir de la

source: GMB Reviews page in the admin
fr_fr: Page des avis GMB dans l’administration

source: Google API Configuration Guide
fr_fr: Guide de configuration de l’API Google

source: This process requires a Google Cloud Console account. The complete setup takes approximately 15 minutes. Step 4 requires validation from Google which can take 1-3 business days.
fr_fr: Ce processus nécessite un compte Google Cloud Console. L’installation complète prend environ 15 minutes. L’étape 4 nécessite une validation de Google, ce qui peut prendre de 1 à 3 jours ouvrés.

source: 1. Create a Google Cloud Console Account and Project
fr_fr: 1. Créer un compte et un projet Google Cloud Console

source: Access Google Cloud Console
fr_fr: Accédez à Google Cloud Console

source: Go to <a href="%s" target="_blank">Google Cloud Console</a>
fr_fr: Allez sur <a href="%s" target="_blank">Google Cloud Console</a>

source: Sign in with your Google account (Gmail).
fr_fr: Connectez-vous avec votre compte Google (Gmail).

source: Create a New Project
fr_fr: Créer un nouveau projet

source: In the top navigation bar, click on the project dropdown (it may say "Select a project" if you're new).
fr_fr: Dans la barre de navigation du haut, cliquez sur le menu déroulant du projet (cela peut être « Sélectionner un projet » si vous êtes nouveau).

source: Click on <strong>"New Project"</strong> in the top right corner of the modal.
fr_fr: Cliquez sur <strong>« Nouveau projet »</strong> en haut à droite du modal.

source: Enter a project name (example: "My Business Reviews" or "WordPress GMB API"). You can leave the organization field empty if you don't have one.
fr_fr: Saisissez un nom de projet (exemple : « Avis Google » ou « WordPress GMB API »). Vous pouvez laisser le champ d’organisation vide si vous n’en avez pas.

source: Click <strong>"Create"</strong>.
fr_fr: <strong>Cliquez sur « Créer</strong> ».

source: Wait a few seconds for the project to be created, then select it from the project dropdown.
fr_fr: Attendez quelques secondes que le projet soit créé, puis sélectionnez le dans le menu déroulant du projet.

source: Make sure you have the correct project selected in the top navigation bar before proceeding to the next steps.
fr_fr: Assurez-vous d’avoir sélectionné le bon projet dans la barre de navigation en haut avant de passer aux étapes suivantes.

source: 2. Configure OAuth Consent Screen
fr_fr: 2. Configurez l’écran de consentement OAuth

source: Before creating credentials, you must configure the OAuth consent screen. This is what users will see when authorizing your application to access their Google My Business data.
fr_fr: Avant de créer les identifiants, vous devez configurer l’écran de consentement OAuth. C’est ce que les utilisateurs verront lorsqu’ils autorisent votre application à accéder à leurs données Google My Business.

source: Initial Configuration
fr_fr: Configuration initiale

source: In the left sidebar menu, go to <strong>"APIs & Services → OAuth consent screen"</strong>.
fr_fr: Dans le menu latéral de gauche, allez dans <strong>"APIs & Services → écran de consentement OAuth "</strong>.

source: You have a screen with "Google Auth Platform not configured yet" and a button <strong>"Get started"</strong>. Click the button.
fr_fr: Vous avez un écran avec « Google Auth Platform non encore configuré » et un bouton <strong>« Commencer ».</strong> Cliquez sur le bouton.

source: Fill the project configuration and click on <strong>"Create"</strong>
fr_fr: Remplissez la configuration du projet et cliquez sur <strong>« Créer »</strong>

source: App information
fr_fr: Informations sur l’application

source: App name : [Enter a name for your application (e.g., "My website reviews")].
fr_fr: Nom de l'application : [Saisissez un nom pour votre application (par exemple, « Avis de mon site web »)].

source: Support email : [Select your email address from the dropdown.]
fr_fr: Email de support : [Sélectionnez votre adresse e-mail dans le menu déroulant.]

source: Choose : "External" (if you have a Google Workspace account choose "Internal")
fr_fr: Choisissez : « Externe » (si vous avez un compte Google Workspace, choisissez « Interne »)

source: Add Test Users (If you have Google Workspace account, skip this step)
fr_fr: Ajouter des utilisateurs de test (Si vous avez un compte Google Workspace, sauter cette étape)

source: In the left sidebar, go to <strong>"Google Auth Platform → Audience"</strong>.
fr_fr: Dans la barre latérale de gauche, allez dans <strong>" Google Auth Platform → Audience "</strong>.

source: In the <strong>"Test users"</strong> section, click <strong>"+ Add test user"</strong>.
fr_fr: Dans la <strong>section " Tester les utilisateurs ",</strong> cliquez <strong>sur " + Ajouter l’utilisateur de test "</strong>.

source: Add the Gmail address(es) that manage your Google My Business account.
fr_fr: Ajoutez l’adresse ou les adresses Gmail qui gèrent votre compte Google My Business.

source: Click <strong>"Save"</strong>.
fr_fr: Cliquez <strong>sur « Enregistrer</strong> ».

source: 3. Create OAuth 2.0 Client ID and Configure Scopes
fr_fr: 3. Créer un identifiant client OAuth 2.0 et configurer les scopes

source: Now you'll create the Client ID and Client Secret that the plugin needs to connect to Google's APIs, and configure the necessary scopes.
fr_fr: Vous allez maintenant créer l’ID client et le secret client dont le plugin a besoin pour se connecter aux API de Google, et configurer les périmètres nécessaires.

source: Start Creating OAuth Client
fr_fr: Commencez à créer un client OAuth

source: <strong>Option 1:</strong> Click the <strong>"Create OAuth client"</strong> button from the OAuth Consent Screen page.
fr_fr: <strong>Option 1 :</strong> Cliquez sur le bouton <strong>« Créer un client OAuth »</strong> depuis la page de l’écran de consentement OAuth.

source: <strong>Option 2:</strong> Go to <strong>"APIs & Services" → "Credentials"</strong>, then click <strong>"+ CREATE CREDENTIALS" → "OAuth client ID"</strong>.
fr_fr: <strong>Option 2 :</strong> Allez dans <strong>« APIs & Services » → « Identifiants »,</strong> puis cliquez <strong>sur « + CRÉER IDENTIFIANTS » → « OAuth client ID »</strong>.

source: Configure Client Details
fr_fr: Configurez les détails du client

source: Fill the OAuth client ID configuration and click on <strong>"Create"</strong>
fr_fr: Remplissez la configuration OAuth de l’ID client et cliquez sur <strong>« Créer »</strong>

source: Application type
fr_fr: Type d'application

source: Select <strong>"Web application"</strong>
fr_fr: Sélectionnez <strong>« Application Web »</strong>

source: Name
fr_fr: Nom

source: Give it a descriptive name ("WordPress GMB Reviews Plugin")
fr_fr: Donnez-lui un nom descriptif (« WordPress GMB Reviews Plugin »)

source: Authorized redirect URIs
fr_fr: URI de redirection autorisée

source: Click <strong>"+ ADD URI"</strong>
fr_fr: Cliquez <strong>sur « + AJOUTER URI »</strong>

source: Copy and paste the Redirect URI :
fr_fr: Copiez-collez l’URI de Redirection :

source: A modal will appear with your <strong>Client ID</strong> and <strong>Client Secret</strong>.
fr_fr: Un modal apparaîtra avec votre <strong>identifiant client</strong> et votre <strong>secret client</strong>.

source: Copy your Client ID and client Secret and save in safe place, be careful you can copy Client Secret only once !
fr_fr: Copiez votre identifiant client et votre secret client et enregistrez-les en lieu sûr, faites attention à ne pouvoir copier le secret client qu’une seule fois !

source: Go back to the plugin and go to the <strong>"Configuration"</strong> page and paste your client ID/Secret into the specific fields
fr_fr: Retournez sur le plugin et allez sur la page <strong>« Configuration »</strong> et collez votre identifiant client/Secret dans les champs spécifiques

source: If you lose your customer secret code, you can create a new one on the "Add a secret code" configuration page. A new secret code will then be generated. If it is no longer in use, delete the old one.
fr_fr: Si vous perdez votre code secret client, vous pouvez en créer un nouveau sur la page de configuration « Ajouter un code secret ». Un nouveau code secret sera alors généré. Si elle n’est plus utilisée, supprimez l’ancienne.

source: 4. Request Access to Google My Business API
fr_fr: 4. Demander l’accès à Google My Business API

source: The Google My Business API (also called Google Business Profile API) is restricted and requires explicit approval from Google. This is a mandatory step and can take 1-3 business days.
fr_fr: L’API Google My Business (également appelée Google Business Profile API) est restreinte et nécessite une approbation explicite de la part de Google. C’est une étape obligatoire qui peut prendre de 1 à 3 jours ouvrés.

source: Why is this step necessary?
fr_fr: Pourquoi cette étape est-elle nécessaire ?

source: Google has restricted access to the Business Profile APIs to prevent abuse. Even though you've created a project and credentials, you won't be able to access business reviews until Google approves your project.
fr_fr: Google a restreint l’accès aux API de profil professionnel pour prévenir les abus. Même si vous avez créé un projet et des identifiants, vous ne pourrez pas accéder aux avis professionnels tant que Google n’aura pas approuvé votre projet.

source: Submit the Access Request Form
fr_fr: Soumettez le formulaire de demande d’accès

source: Go to the <a href="%s" target="_blank">Google Business Profile API Access Request Form</a>.
fr_fr: Rendez-vous sur le <a href="%s" target="_blank">formulaire de demande d’accès à l’API du profil professionnel Google</a>.

source: In the section "How can we help you?", select <strong>"Request for basic access to API"</strong>
fr_fr: Dans la section « Comment pouvons-nous vous aider ? », sélectionnez <strong>« Demande d’accès de base à l’API »</strong>

source: Fill rest of the request form and click on <strong>"Send"</strong>
fr_fr: Remplissez le reste du formulaire de demande et cliquez sur <strong>« Envoyer »</strong>

source: Sign in with the same Google account you used to create the Cloud Console project.
fr_fr: Connectez-vous avec le même compte Google que vous avez utilisé pour créer le projet Cloud Console.

source: Fill out the form with the following information:
fr_fr: Remplissez le formulaire avec les informations suivantes :

source: Submit the form.
fr_fr: Envoyer le formulaire.

source: Wait for Google's Approval
fr_fr: Attendez l’approbation de Google

source: Google will review your request. This typically takes 1-3 business days, but can sometimes take longer.
fr_fr: Google examinera votre demande. Cela prend généralement 1 à 3 jours ouvrés, mais peut parfois prendre plus longtemps.

source: Enable the Google Business Profile API
fr_fr: Activez l’API du profil professionnel Google

source: Once you receive approval, you need to enable the API:
fr_fr: Une fois l’approbation reçue, vous devez activer l’API :

source: Go back to %s.
fr_fr: Retournez sur %s.

source: Make sure your project is selected in the top navigation bar.
fr_fr: Assurez-vous que votre projet est sélectionné dans la barre de navigation en haut.

source: In the search bar at the top, type <strong>"Google Business Profile API"</strong>.
fr_fr: Dans la barre de recherche en haut, tapez <strong>« Google Business Profile API »</strong>.

source: Click on <strong>"Google Business Profile API"</strong> in the results.
fr_fr: Cliquez sur <strong>« Google Business Profile API »</strong> dans les résultats.

source: Click the <strong>"ENABLE"</strong> button.
fr_fr: Cliquez sur le <strong>bouton « ACTIVER</strong> ».

source: Optionally, also enable these related APIs (follow the same process):
fr_fr: Optionnellement, activez également ces API associées (suivant le même processus) :

source: Success!
fr_fr: Succès !

source: Once the APIs are enabled, you can return to this page and complete the authentication by clicking "Connect to Google My Business" above.
fr_fr: Une fois les API activées, vous pouvez revenir sur cette page et compléter l’authentification en cliquant sur « Connecter à Google My Business » ci-dessus.

source: Troubleshooting
fr_fr: Dépannage

source: Error: "Access Not Configured"
fr_fr: Erreur : « Accès non configuré »

source: This means you haven't been approved for the Google Business Profile API yet, or you haven't enabled it after approval. Complete Step 4 above.
fr_fr: Cela signifie que vous n’avez pas encore été approuvé pour l’API du profil professionnel Google, ou que vous ne l’avez pas activée après approbation. Terminez l’étape 4 ci-dessus.

source: Error: "Invalid OAuth Redirect URI"
fr_fr: Erreur : « URI de redirection OAuth invalide »

source: Make sure the Redirect URI in your Google Cloud Console credentials EXACTLY matches the one shown in the gray box above. Check for trailing slashes and extra spaces.
fr_fr: Assurez-vous que l’URI de Redirection dans vos identifiants Google Cloud Console correspond EXACTEMENT à celui affiché dans la case grise ci-dessus. Vérifiez s’il y a des barres qui traînent et des espaces supplémentaires.

source: Error: "Access blocked: This app's request is invalid"
fr_fr: Erreur : « Accès bloqué : La demande de cette application est invalide »

source: This usually means you haven't added the correct OAuth scopes in Step 2. Go back and verify both scopes are added.
fr_fr: Cela signifie généralement que vous n'avez pas ajouté les bons scopes OAuth à l'étape 2. Retournez vérifier que les deux scopes ont été ajoutés.

source: Error: "This app is blocked"
fr_fr: Erreur : « Cette application est bloquée »

source: If your app is in Testing mode, make sure the Google account you're using is added as a Test User in Step 2.
fr_fr: Si votre application est en mode Test, assurez-vous que le compte Google que vous utilisez est ajouté comme Utilisateur Test à l’étape 2.

source: Need more help?
fr_fr: Besoin d'aide ?

source: Visit Google's Official Documentation
fr_fr: Consultez la documentation officielle de Google

source: Assign to reviews
fr_fr: Assigner aux avis

source: Go to Google Reviews and check the appropriate categories for each review.
fr_fr: Allez dans Google Reviews et cochez les catégories appropriées pour chaque avis.

source: Use in shortcode
fr_fr: Utiliser dans le shortcode

source: Filter reviews by category with:
fr_fr: Filtrez les avis par catégorie avec :

source: Multiple categories
fr_fr: Catégories multiple

source: A review can have multiple categories. For use this please separate slug with comma expl:
fr_fr: Un avis peut comporter plusieurs catégories. Pour l’utiliser, veuillez séparer le slug de la virgule :

source: How to use categories
fr_fr: Comment utiliser les catégories

source: Before start
fr_fr: Avant de commencer

source: To operate you will need to follow instructions on the tab "Documentation". There you'll find the steps to configure access to reviews for your business listing. You'll also need Google validation (which can take 1-3 business days) before you can use the API.
fr_fr: Pour fonctionner, vous devrez suivre les instructions de l’onglet « Documentation ». Vous y trouverez les étapes pour configurer l’accès aux avis pour votre annonce d’entreprise. Vous aurez aussi besoin d’une validation Google (qui peut prendre 1 à 3 jours ouvrables) avant de pouvoir utiliser l’API.

source: How to use a shortcode in WordPress?
fr_fr: Comment utiliser un shortcode dans WordPress ?

source: <p>A shortcode is a small piece of code in brackets that allows you to display specific content on your site.</p> <h4>Using it's very simple</h4> <ol> <li>Copy the shortcode</li> <li>Open the page or post where you want to display your reviews</li> <li>Paste the shortcode directly into the text editor</li> <li>Publish or update your page</li> </ol> <p>The shortcode will automatically transform into visible content on your site! You can place it anywhere: in a page, a post, or even in a widget area depending on your theme.</p>
fr_fr: <p>Un shortcode est un petit morceau de code entre crochets qui vous permet d’afficher un contenu spécifique sur votre site.</p> <h4>L’utiliser est très simple</h4> <ol> <li>Copiez le code court</li> <li>Ouvrez la page ou postez là où vous souhaitez afficher vos avis</li> <li>Collez le code court directement dans l’éditeur de texte</li> <li>Publiez ou mettez à jour votre page</li> </ol> <p>Le shortcode se transformera automatiquement en contenu visible sur votre site ! Vous pouvez le placer n’importe où : dans une page, un article, ou même dans une zone widget selon votre thème.</p>

source: Customization
fr_fr: Personnalisation

source: 1. Google API Configuration
fr_fr: 1. Configuration de l’API Google

source: HTTPS Required
fr_fr: HTTPS Obligatoire

source: For security reasons, HTTPS is required to save API credentials. Please enable SSL/TLS on your site.
fr_fr: Pour des raisons de sécurité, HTTPS est nécessaire pour sauvegarder les identifiants de l’API. Veuillez activer SSL/TLS sur votre site.

source: API credentials configured
fr_fr: Identifiants API configurés

source: Client secret is encrypted and secured
fr_fr: Le secret client est chiffré et sécurisé

source: API credentials not configured
fr_fr: Identifiants API non configurés
