Repository: wolvesart/reviews-for-google-my-business
Catalog: languages/reviews-for-google-*-business-*.po
Languages: fr_fr

source: You must first configure your Google Cloud credentials to use this feature.
fr_fr: Vous devez d’abord configurer vos identifiants Google Cloud pour utiliser cette fonctionnalité.

source: Edit API credentials
fr_fr: Modifier les identifiants de l’API

source: Add API credentials
fr_fr: Ajouter des identifiants API

source: Your Google Cloud Client ID must end with
fr_fr: Votre identifiant client Google Cloud doit se terminer par

source: Leave blank to keep current secret, or enter new secret to update
fr_fr: Laissez vide pour garder le secret actuel, ou entrez un nouveau secret pour mettre à jour

source: Your Google Cloud Client Secret
fr_fr: Votre secret client Google Cloud

source: Default:
fr_fr: Par défaut :

source: This URI must match the one configured in Google Cloud
fr_fr: Cette URI doit correspondre à celle configurée dans Google Cloud

source: Save credentials
fr_fr: Enregistrer les identifiants

source: 2. Google My Business OAuth Authentication
fr_fr: 2. Authentification OAuth de mon entreprise sur Google

source: Please configure your API credentials above before authenticating.
fr_fr: Veuillez configurer vos identifiants API ci-dessus avant de vous authentifier.

source: Authenticated
fr_fr: Authentifié

source: Re-authenticate
fr_fr: Réauthentifier

source: Delete tokens?
fr_fr: Supprimer les jetons ?

source: Revoke access
fr_fr: Révoquer l'accès

source: Not authenticated
fr_fr: Non authentifié

source: Connect with Google
fr_fr: Connectez-vous avec Google

source: 3. Select your location
fr_fr: 3. Sélectionnez votre emplacement

source: Location Google My Business
fr_fr: Localisation Google My Business

source: -- Select a location --
fr_fr: -- Sélectionner un lieu --

source: Select the Google My Business location whose reviews you want to display.
fr_fr: Sélectionnez la fiche Google My Business dont vous souhaitez afficher les avis.

source: Save location
fr_fr: Enregistrer l’emplacement

source: Refresh list
fr_fr: Actualiser la liste

source: No locations were found. Click the button below to search for your Google My Business locations.
fr_fr: Aucun lieu n’a été trouvé. Cliquez sur le bouton ci-dessous pour rechercher vos emplacements Google My Business.

source: Search my locations
fr_fr: Cherche mes emplacements

source: You must first authenticate yourself
fr_fr: Vous devez d’abord vous authentifier vous-même

source: Go back to the second step to connect your Google account.
fr_fr: Retournez à la deuxième étape pour connecter votre compte Google.

source: 4. Test connection
fr_fr: 4. Tester la connexion

source: Test reviews retrieval
fr_fr: Tester la récupération des avis

source: This will delete the cache and ALL reviews. Are you sure?
fr_fr: Cela supprimera le cache et TOUS les avis. Es-tu sûr?

source: Reset
fr_fr: Réinitialiser

source: Shortcode usage
fr_fr: Utilisation de code court

source: To display Google My Business reviews on your site, use the following shortcode in your pages, posts or widgets:
fr_fr: Pour afficher les avis Google My Business sur votre site, utilisez le code court suivant dans vos pages, articles ou widgets :

source: Copy
fr_fr: Copier

source: Number of reviews
fr_fr: Nombre d'avis

source: Number of reviews to display. Leave blank if you want to display the maximum number of reviews
fr_fr: Nombre d’avis à afficher. Laissez le blanc si vous souhaitez afficher le maximum d’avis

source: No categories
fr_fr: Aucune catégorie

source: Select one or multiple categories to filter reviews
fr_fr: Sélectionnez une ou plusieurs catégories pour filtrer les avis

source: Show summary
fr_fr: Afficher le résumé

source: Display average rating and total reviews
fr_fr: Afficher la note moyenne et le total des avis

source: Available parameters
fr_fr: Paramètres disponibles

source: Number of reviews to display (maximum 100)
fr_fr: Nombre d’avis à afficher (maximum 100)

source: Filter by category (use the category slug)
fr_fr: Filtrez par catégorie (utilisez le slug de catégorie)

source: Display the average rating summary (default: true). Set to "false" to hide it.
fr_fr: Affichez le résumé moyen de la note (par défaut : vrai). Réglez sur « faux » pour le cacher.

source: Basic usage examples
fr_fr: Exemples d’utilisation de base

source: Display all reviews (maximum 100)
fr_fr: Afficher tous les avis (maximum 100)

source: Display 20 reviews
fr_fr: Afficher 20 avis

source: Display only reviews from the "formation" category
fr_fr: Afficher uniquement les avis de la catégorie « formation »

source: Display 10 reviews from "formation" OR "coaching"
fr_fr: Affichez 10 avis de « formation » OU « coaching »

source: Review card
fr_fr: Carte d'avis

source: Text resume
fr_fr: Texte du résumé

source: Color of text and overall rating in summary
fr_fr: Couleur du texte et note globale en résumé

source: Background color
fr_fr: Couleur de l'arrière-plan

source: Border radius
fr_fr: Rayon de la bordure

source: Star color
fr_fr: Couleur des étoiles

source: Text color
fr_fr: Couleur du texte

source: Accent color
fr_fr: Couleur d’accentuation

source: Color of the slider arrows and pagination points. Color of the "Read more" button on hover.
fr_fr: Couleur des flèches cursantes et des points de pagination. Couleur du bouton « Lire plus » en survolant.

source: Save customization
fr_fr: Enregistrer la personnalisation

source: Reset to default values
fr_fr: Réinitialiser les valeurs par défaut

source: Create a new category
fr_fr: Créer une nouvelle catégorie

source: Categories allow you to organize your Google My Business reviews and filter them on your website.
fr_fr: Les catégories vous permettent d’organiser vos avis Google My Business et de les filtrer sur votre site web.

source: New category name (e.g: Training, Coaching, Design...)
fr_fr: Nouveau nom de catégorie (par exemple : Formation, Coaching, Design...)

source: Existing categories (%d)
fr_fr: Catégories existantes (%d)

source: Slug
fr_fr: Identifiant

source: No categories created yet.
fr_fr: Aucune catégorie n’a encore été créée.

source: Create your first category above to start organizing your reviews.
fr_fr: Créez votre première catégorie ci-dessus pour commencer à organiser vos avis.

source: Before start, go to the Configuration page to connect your account Google Cloud Console
fr_fr: Avant de commencer, allez sur la page de configuration pour connecter votre compte Google Cloud Console

source: Error details
fr_fr: Détails de l'erreur

source: Configure authentification
fr_fr: Configurer l’authentification

source: No reviews have been synchronized yet. Click the button below to fetch and sync reviews from Google My Business API.
fr_fr: Aucun avis n’a encore été synchronisé. Cliquez sur le bouton ci-dessous pour récupérer et synchroniser les avis depuis Google My Business API.

source: Sync Reviews from API
fr_fr: Synchroniser les avis depuis l’API

source: Check configuration
fr_fr: Vérifier la configuration

source: Review found (%s)
fr_fr: Avis trouvé (%s)

source: Rating
fr_fr: Note

source: Job Title
fr_fr: Titre du poste

source: Category
fr_fr: Catégorie

source: Save
fr_fr: Sauvegarder

source: Previous
fr_fr: Précédent

source: Next
fr_fr: Suivant

source: Read more
fr_fr: Lire la suite

source: Display your Google My Business reviews on your website for free. Improve your credibility and gain trust. Category system, full customization, and flexible shortcode.
fr_fr: Affichez gratuitement vos avis Google My Business sur votre site. Améliorez votre crédibilité et gagnez la confiance. Système de catégories, personnalisation complète et shortcode flexible.
